{
  "_name_or_path": "distilt5-disco-qaamr-multi/checkpoint-6244",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "init_metadata": {
    "copied_decoder_layers": [
      0,
      2,
      4,
      7,
      9,
      11
    ],
    "copied_encoder_layers": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      11
    ],
    "teacher_type": "t5"
  },
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 6,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 32,
      "num_beams": 4,
      "prefix": ""
    }
  },
  "vocab_size": 32102
}
